accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/services/GetServiceParameters-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/ServiceManagement/GetServiceParameters">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetServiceParametersResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <get:ContractId>?</get:ContractId>
               <!--Optional:-->
               <get:ContractIdPub>?</get:ContractIdPub>
               <!--Optional:-->
               <get:ContractStatus>?</get:ContractStatus>
               <!--Optional:-->
               <get:ProfileId>?</get:ProfileId>
               <!--Optional:-->
               <get:ServicePackageCode>?</get:ServicePackageCode>
               <!--Optional:-->
               <get:ServicePackageCodePub>?</get:ServicePackageCodePub>
               <!--Optional:-->
               <get:ServiceCode>?</get:ServiceCode>
               <!--Optional:-->
               <get:ServiceCodePub>?</get:ServiceCodePub>
               <!--Optional:-->
               <get:ServiceType>?</get:ServiceType>
               <!--Optional:-->
               <get:ServiceSubType>?</get:ServiceSubType>
               <!--Optional:-->
               <get:ServiceParameterList>
                  <!--Zero or more repetitions:-->
                  <get:ServiceParameterNode>
                     <!--Optional:-->
                     <get:PrmNo>?</get:PrmNo>
                     <!--Optional:-->
                     <get:PrmId>?</get:PrmId>
                     <!--Optional:-->
                     <get:PrmIdPub>?</get:PrmIdPub>
                     <!--Optional:-->
                     <get:PrmOverrideInd>?</get:PrmOverrideInd>
                     <!--Optional:-->
                     <get:PrmType>?</get:PrmType>
                     <!--Optional:-->
                     <get:PrmDes>?</get:PrmDes>
                     <!--Optional:-->
                     <get:MultipleValues>?</get:MultipleValues>
                     <!--Optional:-->
                     <get:ValueList>
                        <!--Zero or more repetitions:-->
                        <get:ValueNode>
                           <!--Optional:-->
                           <get:PrmValue>?</get:PrmValue>
                           <!--Optional:-->
                           <get:PrmValuePub>?</get:PrmValuePub>
                           <!--Optional:-->
                           <get:PrmValueDes>?</get:PrmValueDes>
                           <!--Optional:-->
                           <get:PrmValueSeqNo>?</get:PrmValueSeqNo>
                           <!--Optional:-->
                           <get:PrmValidFrom>?</get:PrmValidFrom>
                        </get:ValueNode>
                     </get:ValueList>
                  </get:ServiceParameterNode>
               </get:ServiceParameterList>
            </lcew:Body>
         </Response>
      </web:GetServiceParametersResponse>
   </soapenv:Body>
</soapenv:Envelope>